# FailureMessageAccessor Properties

---
The FailureMessageAccessor type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace